Revit 2024 API
ExecutedEventArgs Class
The event arguments used by AddInCommandBinding's Executed event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ExecutedEventArgs : CommandEventArgs
Visual Basic
Public Class ExecutedEventArgs _
	Inherits CommandEventArgs
Visual C++
public ref class ExecutedEventArgs : public CommandEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.ExecutedEventArgs
See Also
ExecutedEventArgs Members
Autodesk.Revit.UI.Events Namespace